# Advanced Dataframes

## Examples problems from curriculum

In [2]:
import pandas as pd
import numpy as np
from pydataset import data

Format for connection string: protocol://[user[:password]@]hostname/[database_name]

Example of what one might look like: mysql+pymysql://codeup:p@assw0rd@123.123.123.123/some_db

In [3]:
# import necessary info from env.py file

from env import host, user, password

In [4]:
# create url

url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [5]:
# read in some data using this url
# format is pd.read_sql(query, url)

pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [6]:
sql = '''
SELECT
    emp_no,
    first_name,
    last_name
FROM employees
WHERE gender = 'F'
LIMIT 100
'''

employees = pd.read_sql(sql, url)
employees.head()

   emp_no first_name  last_name
0   10002    Bezalel     Simmel
1   10006     Anneke    Preusig
2   10007    Tzvetan  Zielinski
3   10009     Sumant       Peac
4   10010  Duangkaew   Piveteau

In [7]:
query = '''
SELECT
    t.title as title,
    d.dept_name as dept_name
FROM titles t
JOIN dept_emp USING (emp_no)
JOIN departments d USING (dept_no)
LIMIT 100
'''

title_dept = pd.read_sql(query, url)
title_dept.head()

          title         dept_name
0         Staff  Customer Service
1  Senior Staff  Customer Service
2         Staff  Customer Service
3  Senior Staff  Customer Service
4         Staff  Customer Service

## Exercises I

#### 3. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [8]:
def get_db_url(user, host, password, database):
    return f'mysql+pymysql://{user}:{password}@{host}/{database}'

#### 4. Use your function to obtain a connection to the employees database.

In [9]:
pd.read_sql('SELECT * FROM employees LIMIT 5', get_db_url(user, host, password, 'employees'))

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

#### 5. Once you have successfully run a query:

##### a. Intentionally make a typo in the database url. What kind of error message do you see?

In [10]:
#pd.read_sql('SELECT * FROM employees LIMIT 5', get_db_url(user, host, password, 'employeesss'))

# OperationalError: (pymysql.err.OperationalError) (1044, "Access denied for user 'germain_1478'@'%' to database 'employeesss'")
# (Background on this error at: http://sqlalche.me/e/14/e3q8)

##### b. Intentionally make an error in your SQL query. What does the error message look like?

In [11]:
# pd.read_sql('SELECT FROM employees LIMIT 5', get_db_url(user, host, password, 'employees'))

# ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'FROM employees LIMIT 5' at line 1")
# [SQL: SELECT FROM employees LIMIT 5]
# (Background on this error at: http://sqlalche.me/e/14/f405)

#### 6. Read the employees and titles tables into two separate DataFrames.

In [12]:
employees = pd.read_sql('SELECT * FROM employees', get_db_url(user, host, password, 'employees'))
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [13]:
titles = pd.read_sql('SELECT * FROM titles', get_db_url(user, host, password, 'employees'))
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

#### 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [14]:
employees.shape
# yes, this is what I expected (same dimensions as table in SQL Ace)

(300024, 6)

In [15]:
titles.shape
# yes, this is what I expected (same dimensions as table in SQL Ace)

(443308, 4)

#### 8. Display the summary statistics for each DataFrame.

In [16]:
employees.describe()
# not super useful since the emp_no column is the only numerical column in this df

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [17]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [18]:
titles.describe()
# not super useful since the emp_no column is the only numerical column in this df

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [19]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

#### 9. How many unique titles are in the titles DataFrame?

In [20]:
titles.title.unique().size

7

In [21]:
titles.title.nunique()

7

In [22]:
titles.title.value_counts().size

7

#### 10. What is the oldest date in the to_date column?

In [23]:
titles.to_date.min()

datetime.date(1985, 3, 1)

In [24]:
titles.sort_values(by='to_date').head(1)

       emp_no     title   from_date     to_date
16064   20869  Engineer  1985-02-17  1985-03-01

#### 11. What is the most recent date in the to_date column?

In [25]:
titles.to_date.max()
# this just means currently employed
# would be more useful to find most recent to date that is not this value

datetime.date(9999, 1, 1)

In [26]:
# another way to do this and get whole row
titles.sort_values(by='to_date', ascending=False).head(1)

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01

In [27]:
# my method to get most recent to date that is not "currently employed"
# this returns the date used in this db to mean "currently employed"
titles.to_date[0]

datetime.date(9999, 1, 1)

In [28]:
# This returns the most recent to_date that is not "currently employed"
titles[titles.to_date != titles.to_date[0]].to_date.max()

datetime.date(2002, 8, 1)

In [29]:
# this returns a df of all employees with the most recent to_date that is not "currently employed"
# titles[titles.to_date == titles[titles.to_date != titles.to_date[0]].to_date.max()]

In [30]:
# this returns the number of employees with that to_date instead of the whole df
titles[titles.to_date == titles[titles.to_date != titles.to_date[0]].to_date.max()].shape[0]

40

## Exercises II

#### 1. Copy the users and roles DataFrames from the examples above.

In [31]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [32]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

#### 2. What is the result of using a right join on the DataFrames?

In [33]:
users.merge(roles, how='right', left_on='role_id', right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

#### 3. What is the result of using an outer join on the DataFrames?

In [34]:
users.merge(roles, how='outer', left_on='role_id', right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

#### 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [35]:
# users = users.drop(columns='role_id')
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [36]:
# you now have nothing to join on and would have no way to join the tables and align rows properly

#### 5. Load the mpg dataset from PyDataset.

In [37]:
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

#### 6. Output and read the documentation for the mpg dataset.

In [38]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

#### 7. How many rows and columns are in the dataset?

In [39]:
mpg.shape

(234, 11)

#### 8. Check out your column names and perform any cleanup you may want on them.

In [40]:
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')

In [41]:
mpg = mpg.rename(columns={
    'displ' : 'eng_displacement',
    'cyl' : 'num_of_cylinders',
    'trans' : 'trans_type',
    'cty' : 'city_mpg',
    'hwy' : 'hwy_mpg',
    'fl' : 'fuel_type',
    'class' : 'vehicle_type'
})

mpg.head()

,manufacturer,model,eng_displacement,year,num_of_cylinders,trans_type,drv,city_mpg,hwy_mpg,fuel_type,vehicle_type
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact

#### 9. Display the summary statistics for the dataset.

In [42]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   manufacturer      234 non-null    object
 1   model             234 non-null    object
 2   eng_displacement  234 non-null    float64
 3   year              234 non-null    int64
 4   num_of_cylinders  234 non-null    int64
 5   trans_type        234 non-null    object
 6   drv               234 non-null    object
 7   city_mpg          234 non-null    int64
 8   hwy_mpg           234 non-null    int64
 9   fuel_type         234 non-null    object
 10  vehicle_type      234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [43]:
mpg.describe()

       eng_displacement         year  num_of_cylinders    city_mpg     hwy_mpg
count        234.000000   234.000000        234.000000  234.000000  234.000000
mean           3.471795  2003.500000          5.888889   16.858974   23.440171
std            1.291959     4.509646          1.611534    4.255946    5.954643
min            1.600000  1999.000000          4.000000    9.000000   12.000000
25%            2.400000  1999.000000          4.000000   14.000000   18.000000
50%            3.300000  2003.500000          6.000000   17.000000   24.000000
75%            4.600000  2008.000000          8.000000   19.000000   27.000000
max            7.000000  2008.000000          8.000000   35.000000   44.000000

#### 10. How many different manufacturers are there?

In [44]:
mpg.groupby('manufacturer').manufacturer.count()

manufacturer
audi          18
chevrolet     19
dodge         37
ford          25
honda          9
hyundai       14
jeep           8
land rover     4
lincoln        3
mercury        4
nissan        13
pontiac        5
subaru        14
toyota        34
volkswagen    27
Name: manufacturer, dtype: int64

In [45]:
mpg.groupby('manufacturer').manufacturer.count().size

15

In [46]:
mpg.manufacturer.unique().size

15

In [47]:
mpg.manufacturer.nunique()

15

#### 11. How many different models are there?

In [48]:
mpg.groupby('model').model.count().size

38

In [49]:
mpg.model.unique().size

38

In [50]:
mpg.model.nunique()

38

#### 12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [51]:
mpg['mileage_difference'] = mpg.hwy_mpg - mpg.city_mpg
mpg.head()

,manufacturer,model,eng_displacement,year,num_of_cylinders,trans_type,drv,city_mpg,hwy_mpg,fuel_type,vehicle_type,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

#### 13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [52]:
mpg['average_mileage'] = mpg[['city_mpg', 'hwy_mpg']].mean(axis=1)
mpg.head()

,manufacturer,model,eng_displacement,year,num_of_cylinders,trans_type,drv,city_mpg,hwy_mpg,fuel_type,vehicle_type,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0

#### 14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [53]:
mpg['is_automatic'] = mpg.trans_type.str.startswith('auto')
mpg.head()

,manufacturer,model,eng_displacement,year,num_of_cylinders,trans_type,drv,city_mpg,hwy_mpg,fuel_type,vehicle_type,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True

#### 15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [54]:
mpg.groupby('manufacturer').average_mileage.mean().idxmax()

'honda'

In [55]:
# generate a series of means and sort them to get the highest
mpg.groupby('manufacturer').average_mileage.mean().sort_values(ascending=False).head(1)

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

In [56]:
# generate a series mask and apply it to a derived df to get the row of interest
mpg.groupby('manufacturer').average_mileage.mean()[mpg.groupby('manufacturer').average_mileage.mean() == mpg.groupby('manufacturer').average_mileage.mean().max()]

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

In [57]:
# generate a df and then sort to get max
mpg.groupby('manufacturer').average_mileage.agg(['mean']).sort_values(by='mean', ascending=False).head(1)

              mean
manufacturer
honda         28.5

In [58]:
# generate a df mask and apply it to a df
# the df masks seem to interact differtly as compared to series masks when applied to dfs, not sure why
mpg.groupby('manufacturer').average_mileage.agg(['mean'])[mpg.groupby('manufacturer').average_mileage.agg(['mean']) == mpg.groupby('manufacturer').average_mileage.agg(['mean']).max()]

              mean
manufacturer
audi           NaN
chevrolet      NaN
dodge          NaN
ford           NaN
honda         28.5
hyundai        NaN
jeep           NaN
land rover     NaN
lincoln        NaN
mercury        NaN
nissan         NaN
pontiac        NaN
subaru         NaN
toyota         NaN
volkswagen     NaN

In [83]:
# generate a df mask and apply it to a df
# the df masks seem to interact differtly as compared to series masks when applied to dfs, not sure why
mpg.groupby('manufacturer').average_mileage.agg(['mean'])[mpg.groupby('manufacturer').average_mileage.agg('mean') == mpg.groupby('manufacturer').average_mileage.agg('mean').max()]

              mean
manufacturer
honda         28.5

#### 16. Do automatic or manual cars have better miles per gallon?

In [59]:
mpg.groupby('is_automatic').average_mileage.mean()
# manual cars have better mpg on average in this dataset

is_automatic
False    22.227273
True     19.130573
Name: average_mileage, dtype: float64

In [60]:
mpg.groupby('is_automatic').average_mileage.agg('mean')

is_automatic
False    22.227273
True     19.130573
Name: average_mileage, dtype: float64

## Exercises III

#### 1. Use your get_db_url function to help you explore the data from the chipotle database.

In [61]:
chipotle = pd.read_sql('SELECT * FROM orders', get_db_url(user, host, password, 'chipotle'))
chipotle.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

#### 2. What is the total price for each order?

In [62]:
# create new column that has total for that row
type(chipotle.item_price[0]) # item price columns was a string

str

In [63]:
chipotle.item_price = chipotle.item_price.str.replace('$','')

<ipython-input-63-49deb05bbc37>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  chipotle.item_price = chipotle.item_price.str.replace('$','')

In [64]:
chipotle = chipotle.astype({'item_price': 'float'})

In [65]:
type(chipotle.item_price[0])

numpy.float64

In [66]:
chipotle.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,2.39
1,2,1,1,Izze,[Clementine],3.39
2,3,1,1,Nantucket Nectar,[Apple],3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",16.98

In [67]:
# not necessary, item_price is actually order_price
#chipotle['row_sum'] = chipotle.quantity * chipotle.item_price
#chipotle.head(10)

In [68]:
chipotle.groupby('order_id').item_price.agg(['sum'])

            sum
order_id
1         11.56
2         16.98
3         12.67
4         21.00
5         13.70
...         ...
1830      23.00
1831      12.90
1832      13.20
1833      23.50
1834      28.75

[1834 rows x 1 columns]

#### 3. What are the most popular 3 items?

In [69]:
chipotle.groupby(chipotle.item_name).quantity.sum().sort_values(ascending=False).head(3)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

#### 4. Which item has produced the most revenue?

In [70]:
chipotle.groupby(chipotle.item_name).item_price.sum().sort_values(ascending=False).head(1)

item_name
Chicken Bowl    7342.73
Name: item_price, dtype: float64

#### 5. Join the employees and titles DataFrames together.

In [71]:
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [72]:
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [73]:
emp_title = employees.merge(titles,how='inner', on='emp_no')
emp_title.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01

#### 6. For each title, find the hire date of the employee that was hired most recently with that title.

In [74]:
emp_title.groupby('title').hire_date.agg(['max'])

                           max
title
Assistant Engineer  1999-12-24
Engineer            2000-01-28
Manager             1992-02-05
Senior Engineer     2000-01-01
Senior Staff        2000-01-13
Staff               2000-01-12
Technique Leader    1999-12-31

#### 7. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [75]:
departments = pd.read_sql('SELECT * FROM departments', get_db_url(user, host, password, 'employees'))
departments

  dept_no           dept_name
0    d009    Customer Service
1    d005         Development
2    d002             Finance
3    d003     Human Resources
4    d001           Marketing
5    d004          Production
6    d006  Quality Management
7    d008            Research
8    d007               Sales

In [76]:
dept_emp = pd.read_sql('SELECT * FROM dept_emp', get_db_url(user, host, password, 'employees'))
dept_emp.head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

In [77]:
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [78]:
#join titles to dept_emp using emp_no to get dept_no
titles_dept_no = titles.merge(dept_emp, how='inner', on='emp_no')
titles_dept_no.head()

,emp_no,title,from_date_x,to_date_x,dept_no,from_date_y,to_date_y
0,10001,Senior Engineer,1986-06-26,9999-01-01,d005,1986-06-26,9999-01-01
1,10002,Staff,1996-08-03,9999-01-01,d007,1996-08-03,9999-01-01
2,10003,Senior Engineer,1995-12-03,9999-01-01,d004,1995-12-03,9999-01-01
3,10004,Engineer,1986-12-01,1995-12-01,d004,1986-12-01,9999-01-01
4,10004,Senior Engineer,1995-12-01,9999-01-01,d004,1986-12-01,9999-01-01

In [79]:
#join titles_dept_no to departments on dept_no to get department names
titles_departments = titles_dept_no.merge(departments, how='inner', on='dept_no')
titles_departments.head()

,emp_no,title,from_date_x,to_date_x,dept_no,from_date_y,to_date_y,dept_name
0,10001,Senior Engineer,1986-06-26,9999-01-01,d005,1986-06-26,9999-01-01,Development
1,10006,Senior Engineer,1990-08-05,9999-01-01,d005,1990-08-05,9999-01-01,Development
2,10008,Assistant Engineer,1998-03-11,2000-07-31,d005,1998-03-11,2000-07-31,Development
3,10012,Engineer,1992-12-18,2000-12-18,d005,1992-12-18,9999-01-01,Development
4,10012,Senior Engineer,2000-12-18,9999-01-01,d005,1992-12-18,9999-01-01,Development

In [80]:
pd.crosstab(titles_departments.title, titles_departments.dept_name)

dept_name,Customer Service,Development,Finance,Human Resources,Marketing,Production,Quality Management,Research,Sales
title,,,,,,,,,
Assistant Engineer,298,7769,0,0,0,6445,1831,378,0
Engineer,2362,58135,0,0,0,49649,13852,2986,0
Manager,4,2,2,2,2,4,4,2,2
Senior Engineer,2027,49326,0,0,0,42205,11864,2570,0
Senior Staff,13925,1247,12139,12274,13940,1270,0,11637,36191
Staff,16150,1424,13929,14342,16196,1478,0,13495,41808
Technique Leader,309,7683,0,0,0,6557,1795,393,0